Revit 2027 API
ParameterTypeId.StructuralBraceRepresentation Property
 "Representation Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBraceRepresentation { get; }
Public Shared ReadOnly Property StructuralBraceRepresentation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBraceRepresentation {
	ForgeTypeId^ get ();
}
static member StructuralBraceRepresentation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace